window.onload = function () {
    // 基于准备好的dom，初始化echarts实例
    var myChart = echarts.init(document.getElementById('right'));

    var categories = [{ name: "天山天池" }];
    option = {
        // 图的标题
        // title: {
        //     text: 'ECharts 图谱可视化'
        // },
        // 提示框的配置
        color: ['#91cc75'],
        tooltip: {
            formatter: function (x) {
                return x.data.des;
            }
        },
        // 工具箱
        toolbox: {
            // 显示工具箱
            show: true,
            feature: {
                mark: {
                    show: true
                },
                // 还原
                restore: {
                    show: true
                },
                // 保存为图片
                saveAsImage: {
                    show: true
                }
            }
        },
        legend: [{
            // selectedMode: 'single',
            data: categories.map(function (a) {
                return a.name;
            })
        }],
        series: [{
            type: 'graph', // 类型:关系图
            layout: 'force', //图的布局，类型为力导图
            symbolSize: 40, // 调整节点的大小
            roam: true, // 是否开启鼠标缩放和平移漫游。默认不开启。如果只想要开启缩放或者平移,可以设置成 'scale' 或者 'move'。设置成 true 为都开启
            edgeSymbol: ['circle', 'arrow'],
            edgeSymbolSize: [2, 10],
            edgeLabel: {
                normal: {
                    textStyle: {
                        fontSize: 20,
                        fontcolor: 'white'
                    }
                }
            },
            force: {
                repulsion: 2500,
                edgeLength: [10, 500]
            },
            draggable: true,
            lineStyle: {
                normal: {
                    width: 2,
                    color: '#4b565b',
                }
            },
            edgeLabel: {
                normal: {
                    show: true,
                    formatter: function (x) {
                        return x.data.name;
                    }
                }
            },
            label: {
                normal: {
                    show: true,
                    textStyle: {}
                }
            },
            // 数据
            data: [
                { "name": '天山天池', "symbolSize": 100, "category": '天山天池', "des": "点一点查看更多", "del": '新疆天山天池风景名胜区位于新疆维吾尔自治区昌吉回族自治州阜康市境内博格达峰下的半山腰，是中国国家级风景名胜区、国家AAAAA级风景区。风景区总面积达160平方公里（规划面积548平方公里），以天池为中心，北起石门、南到雪线、西达马牙山、东至大东沟，有完整的4个垂直自然景观带。' },
                { "name": '280元', "symbolSize": 50, "category": '天山天池', "des": "点一点查看更多", "del": "门票价格为280元" },
                {
                    "name": '瑶池', "symbolSize": 50, "category": '天山天池', "des": "点一点查看更多", "del": "瑶池是古代神话传说中西王母所居之地，位于昆仑山上。高大雄伟的昆仑山就好像来自九天之外，白雪皑皑的慕士塔格峰更是高耸擎日。在《山海经校注》上曾经记载，“西王母虽以昆仑为宫，亦自有离宫别窟，游息之处，不专住一山也。天界第一重天，极南之尽，乃王母颐养生息之天庭别府，名为——别有洞天，此亦是瑶池之所在。瑶池也指宫苑中的池。"
                },
                { "name": '瑶池都护府', "symbolSize": 50, "category": '天山天池', "des": "点一点查看更多", "del": "天池古称瑶池，唐太宗时曾在博格达峰下设立过“瑶池都护府”；“天池”大约出现在不到两百年前可能是取天镜、神池两词各一字合成的，曾名海子、龙潭、瑶池、神池等" },
                { "name": '新疆都统明亮', "symbolSize": 50, "category": '天山天池', "des": "点一点查看更多", "del": '乾隆四十一年，清军都统明亮指挥军民修筑乌鲁木齐城，并兴建城隍庙。一天夜里，都统明梦见有个穿戴着儒服儒冠的人向他走来，那人自称姓纪，名永宁，陕西人，天山之神奏请天帝封他为城隍，故而前来拜谒，都统惊醒过来，心中诧异，既难以置信，又不可不信，就将此事向陕西巡抚毕沅写信查询，毕沅即命令陕西各州县在户籍人口的纪氏百姓中查，没查到有叫纪永宁的人。此时，毕沅的幕僚严道甫在编篆《华州志》，他在收集当地史料时，有姓纪者拿了一部纪氏家谱，请求登载其远祖，毕秋帆嘱手下将家谱拿来翻阅，居然其中看到有个人叫“纪永宁”。' },
                { "name": '西小天池', "symbolSize": 50, "category": '天山天池', "des": "点一点查看更多", "del": '西小天池也是在远古冰川运动中形成的堰塞湖。它主要依靠天池补给水源。天池、东小天池和西小天池，堪称"母女池"。大天池为母，东西小天池为女，故东西小天池又有姐妹池之称，东小天池居东，地势高，池稍大，是"大姐"，西小天池居西，地势低，池也小，是"小妹"。两池"相隔数千米远，一路盘山通"。' },
                { "name": '东小天池', "symbolSize": 50, "category": '天山天池', "des": "点一点查看更多", "del": '传说是小飞龙的巢穴，所以又称飞龙潭。又传说这里是西王母沐浴梳洗的地方，故又有“梳洗涧”、“浴仙盆”之称。小天池掩映在茂密的原始森林中，池边灌木丛生，巨石罗列。池水墨绿幽暗，常起波澜。东小天池人迹罕至，显得特别阴森和神秘。它虽然不及西小天池大，但景观特殊，又未经任何修饰，意境不俗。东小天池泻水时又形成了一条高大的瀑布。这条瀑布如白练悬空，飞流而下，瀑声如雷。瀑布溅落时激起的水花烟雾迷离，在阳光照射下，会闪现出小小的彩虹。又浓又厚的水珠象蒙蒙细雨，把两侧的岩石苔藓和花草树木洗刷一新。' },
                { "name": '王母脚盆', "symbolSize": 50, "category": '天山天池', "des": "点一点查看更多", "del": '《灵山天池疏凿水渠碑记》继续写到：“闻水声潺潺，喷薄于断岩之上者，小龙潭也。潭水深碧，其源弗长，然虽流细力微，亦足以占溉近郭。”此处的“小龙潭”即为“王母脚盆”，位于“五十盘天”的第三盘的右下方，海拔1660米，由天池湖水从地下渗漏入池，水似玉汁，犹如王母的冰肌玉体，传说是“王母娘娘的洗脚盆”。池周围塔松竞秀，披绿挂翠，倒映湖中，墨染幽深；到了夜晚碧月当空，静影沉壁，月影微颤，与粼波成趣' },
                {
                    "name": '西王母', "symbolSize": 50, "category": '天山天池', "des": "点一点查看更多", "del": '王母娘娘，又称王母、金母、阿母、西姥、瑶池金母、金母元君、西王母、西灵圣母、太华西真万炁祖母元君、九灵太妙龟山金母、太灵九光龟台金母等，道号为“上圣白玉龟台九灵太真无极圣母 瑶池大圣西王金母 无上清灵元君 统御群仙大天尊”。王母是中国神话里掌管罚恶、预警灾厉的长生女神。一部分学者认为西王母是古人神化的始祖女神。在传统神话中，西王母是女仙之首，主宰阴气、修仙、生育万物的女神。晚期多将西王母奉为婚姻、生育、保护妇女的女神，并大量在民间传说，小说戏曲中出现。许多古籍及传说中都有关于西王母的记载。'
                },
                { "name": '西王母庙', "symbolSize": 50, "category": '天山天池', "des": "点一点查看更多", "del": '西王母祖庙坐落在天池东北岸的山坡上。因为它供奉的是王母娘娘，故又被称作“娘娘庙”。据现在的史料记载，西王母祖庙建于清代乾隆年间，据说此庙当年建筑规模宏大，香火极盛。1932年，西王母祖庙曾毁于战火。九十年代初，台湾道教“慈惠堂”在原西王母祖庙遗址上修建了一座简单的庙宇，供善男信女们朝拜王母娘娘。2000年，当地政府通过招商引资重建了一座气势恢宏的西王母祖庙，恢复了天池湖畔这一著名的古迹。' },
                { "name": '王母', "symbolSize": 50, "category": '天山天池', },
                { "name": '女仙之首', "symbolSize": 50, "category": '天山天池', },
                { "name": '阴气、修仙、生育万物', "symbolSize": 50, "category": '天山天池', },
                { "name": '《山海经·西山经》', "symbolSize": 50, "category": '天山天池', "des": "点一点查看更多", 'del': '华山之首，曰钱来之山，其上多松，其下多洗石。有兽焉，其状如羊而马尾，名曰羬羊，其脂可以已腊。西四十五里，曰松果之山。濩水出焉，北流注于渭，其中多铜。有鸟焉，其名曰螐渠，其状如山鸡，黑身赤足，可以已𦢊。又西六十里，曰太华之山，削成而四方，其高五千仞，其广十里，鸟兽莫居。有蛇焉，名曰肥 𧒭，六足四翼，见则天下大旱。' },
                { "name": '昆仑山', "symbolSize": 50, "category": '天山天池', "des": "点一点查看更多", "del": '昆仑山脉，是横贯中国西部的高大山脉，位于青藏高原北缘，西起帕米尔高原东部，东到柴达木河上游谷地，全长2500余千米；南北最宽处在东经90°，达350千米，最窄处在东经81°附近，为150千米。不同文献其内部划分却不同，有东、西两段之说，也有分为西、中、东三段的。' },
                { "name": '先秦神话', "symbolSize": 50, "category": '天山天池', },
                { "name": '道教神话', "symbolSize": 50, "category": '天山天池', },
                { "name": '民间神话', "symbolSize": 50, "category": '天山天池', },
                { "name": '西小天池瀑布', "symbolSize": 50, "category": '天山天池', "des": "点一点查看更多", "del": '景称为“玉带银帘”飞挂在过西小天池不远的路右侧，凌空垂落数十米，下泻即形成西小天池；传说是王母娘娘的洗澡水，对面山巅上光绪年间建有六角、尖顶的“观瀑亭。' },
                { "name": '醴泉洞', "symbolSize": 50, "category": '天山天池', "des": "点一点查看更多", "del": '为西小天池瀑布的源头，此处似洞非洞，隐蔽难寻，又称“隐乳洞”，故景名为“醴泉隐乳”；泉水从地下涌出，清净甘甜，传说是王母娘娘的醴泉。《史记》卷一百二十三曰：“《禹本记》言：‘河山昆仑。昆仑其高二千五百余里，日月所避隐为光明也，其上有醴泉、瑶池’。”' },
                { "name": '《穆天子传》', "symbolSize": 50, "category": '天山天池', "des": "点一点查看更多", "del": '西晋武帝太康二年（281年）汲县民不准在今河南汲县盗掘了一座战国时期魏国墓葬，出土一大批竹简，均为重要文化典籍，通称“竹书纪年”，其中有《穆天子传》﹑《周穆王美人盛姬死事》，后合并为《穆天子传》，由荀勖校订全书六卷，历代内容多有散佚。' },
                { "name": '周穆王', "symbolSize": 50, "category": '天山天池', "des": "点一点查看更多", "del": '周穆王姬满（？—约前922年），姬姓，名满，又称“穆天子”，周昭王之子，西周第五位君主。在位55年，是西周在位时间最长的周王。' },
                { "name": '李商隐', "symbolSize": 50, "category": '天山天池', "des": "点一点查看更多", "del": '李商隐（约813年～约858年），字义山，号玉谿生，怀州河内（今河南省沁阳市）人。晚唐著名诗人，和杜牧合称“小李杜”。' },
                { "name": '《瑶池》', "symbolSize": 50, "category": '天山天池', "des": "点一点查看更多", "del": '瑶池阿母绮窗开，黄竹歌声动地哀。八骏日行三万里，穆王何事不重来。' },
                { "name": '西王母与周穆王神话故事', "symbolSize": 50, "category": '天山天池', "des": "点一点查看更多", "del": '周穆王曾坐着造父驾驭的八骏马车，西行至戎族所在地， 一路往西登上了舂山，在瑶池与西王母对饮，然后二人对唱歌谣。西王母唱道：“白云在天，道长路远，山川将你我分开，有生之年，你还会再来吗？”穆王答唱：“我要回归东土，治理好国家，使万民富足，达成目标后，我会再回来看你。”听后，西王母低落回道：“我乃天帝之女，居住于西土，受命守护这里，不能远迁。”西行归来三年后，周穆王又开始游历天下，但只到了雷首山和太行山，然后就回到了都城镐京。终生再未见过西王母。' },

            ],


            //inner


            links: [
                { source: '天山天池', target: '280元', name: '景区门票', },
                { source: '天山天池', target: '瑶池', name: '古称', },
                { source: '天山天池', target: '瑶池都护府', name: '历史渊源', },
                { source: '新疆都统明亮', target: '天山天池', name: '勘察地形', },
                { source: '天山天池', target: '西小天池', name: '主要景点', },
                { source: '天山天池', target: '东小天池', name: '主要景点', },
                { source: '西小天池', target: '王母脚盆', name: '别称', },
                { source: '王母脚盆', target: '西王母', },
                { source: '西王母', target: '王母', name: '别称' },
                { source: '西王母', target: '女仙之首', name: '神话地位' },
                { source: '西王母', target: '阴气、修仙、生育万物', name: '掌管' },
                { source: '西王母', target: '《山海经·西山经》', name: '记载于' },
                { source: '天山天池', target: '西王母庙', name: '主要景点' },
                { source: '西王母庙', target: '西王母', },
                { source: '西王母', target: '昆仑山', name: '居所' },
                { source: '西王母', target: '先秦神话', name: '所属分类' },
                { source: '西王母', target: '道教神话', name: '所属分类' },
                { source: '西王母', target: '民间神话', name: '所属分类' },
                { source: '西小天池', target: '西小天池瀑布', name: '包含' },
                { source: '西小天池', target: '醴泉洞', name: '包含' },
                { source: '周穆王', target: '《穆天子传》', name: '记载' },
                { source: '李商隐', target: '《瑶池》', name: '创作' },
                { source: '周穆王', target: '西王母与周穆王神话故事', name: '' },
                { source: '西王母', target: '西王母与周穆王神话故事', name: '' },
                { source: '西王母与周穆王神话故事', target: '《瑶池》', name: '诗歌记载' },
            ],
            categories: categories,
        }]
    };
    myChart.on("click", function (item) {
        let container = document.querySelector(".detail-container");
        if (!item.data.del) {
            item.data.del = '暂无更多介绍'
        }
        container.innerHTML = item.data.del;
    })
    myChart.setOption(option);
}